example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>example</title>
<!-- 2018-12-05 Wed 00:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ccwang-ubuntu" />
</head>
<body>
<div id="content">
<h1 class="title">example</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Headline</a></li>
<li><a href="#sec-2">2. Installing</a></li>
<li><a href="#sec-3">3. setup .emacs file</a>
<ul>
<li><a href="#sec-3-1">3.1. add text to file</a></li>
<li><a href="#sec-3-2">3.2. restart emacs</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. a third level</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. expand and collapse org mode tree</a></li>
<li><a href="#sec-5">5. Add text</a></li>
<li><a href="#sec-6">6. comment</a>
<ul>
<li><a href="#sec-6-1">6.1. comment do not export if you have this tag</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Lists</a></li>
<li><a href="#sec-8">8. <span class="todo TODO">TODO</span> creating todo and done items</a></li>
<li><a href="#sec-9">9. Date and time. No time zone support</a></li>
<li><a href="#sec-10">10. Links</a></li>
<li><a href="#sec-11">11. Tagging entry C-c C-c&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="teaching">teaching</span>&#xa0;<span class="org">org</span></span></a></li>
<li><a href="#sec-12">12. 2nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="raster">raster</span></span></a></li>
<li><a href="#sec-13">13. 3rd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span></span></a></li>
<li><a href="#sec-14">14. Building a table</a></li>
<li><a href="#sec-15">15. Source code</a></li>
<li><a href="#sec-16">16. Dec 5th in AMU <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-05 Wed 00:26&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="day">day</span></span></a>
<ul>
<li><a href="#sec-16-1">16.1. sitting in research tools</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Headline</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installing</h2>
<div class="outline-text-2" id="text-2">
<p>
sudo apt install org
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> setup .emacs file</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> add text to file</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> restart emacs</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> a third level</h4>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> expand and collapse org mode tree</h2>
<div class="outline-text-2" id="text-4">
<p>
&lt;TAB&gt;
</p>

<p>
S-&lt;TAB&gt;  &lt;-&#x2014; S is the shift key &#x2014; expand and collapse all entry 
</p>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Add text</h2>
<div class="outline-text-2" id="text-5">
<p>
Hello world.
</p>

<p>
you  can make <b>bold</b> or <i>italics</i> or if <span class="underline">underline</span>, and <code>code</code>, <code>verbatim</code>
</p>

<p>
C-c C-e b &#x2014;&gt; export to html and open in web browser
</p>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> comment</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> comment do not export if you have this tag</h3>
<div class="outline-text-3" id="text-6-1">
<p>
will not go to html 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Lists</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>an entry
</li>
<li>another entry
<ul class="org-ul">
<li>sub list entry
</li>
<li>another entry in a sublist 
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> this is a todo item
</li>
<li><code>[X]</code> Change state of a todo with C-c C-c
</li>
<li><code>[&#xa0;]</code> Finished task has an X. do not use a 'x'
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> creating todo and done items</h2>
<div class="outline-text-2" id="text-8">
<p>
S-Rightarrow
C-c C-t
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Date and time. No time zone support</h2>
<div class="outline-text-2" id="text-9">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-04 Tue&gt;</span></span> 
</p>

<p>
C-c . &lt;&#x2014; insert date and time stamp
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2018-11-03 Sat&gt;</span></span>
</p>

<p>
S-up or S-down &lt;-&#x2014; change by + or - 1 
</p>

<p>
C-u C-c . &lt;-&#x2014; insert timestamp with time
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-01-18 Fri 22:45&gt;</span></span>
</p>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Links</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="https://wangcc.me">https://wangcc.me</a>
</li>
<li>[[<a href="https://wangcc.me">https://wangcc.me</a>][Chaochen<sub>Wang]]</sub> 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Tagging entry C-c C-c&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="teaching">teaching</span>&#xa0;<span class="org">org</span></span></h2>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 2nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="raster">raster</span></span></h2>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 3rd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span></span></h2>
</div>


<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Building a table</h2>
<div class="outline-text-2" id="text-14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">column 1</th>
<th scope="col" class="left">column 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">some data</td>
<td class="left">123</td>
</tr>

<tr>
<td class="left">dafdafda</td>
<td class="left">fdafda</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Source code</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">

<pre class="src src-sh">echo "Hello World" #C-c C-c
</pre>
</div>

<pre class="example">
Hello World
</pre>

<div class="org-src-container">

<pre class="src src-python">return "Hello World from python" # A comment
</pre>
</div>

<pre class="example">
Hello World from python
</pre>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Dec 5th in AMU <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-05 Wed 00:26&gt;</span></span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="day">day</span></span></h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> sitting in research tools</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Today we talked about grep
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ccwang-ubuntu</p>
<p class="date">Created: 2018-12-05 Wed 00:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
